Revit 2027 API
ParameterUtils.IsBuiltInGroup Method
 Checks whether a ForgeTypeId identifies a built-in parameter group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsBuiltInGroup(
	ForgeTypeId groupTypeId
)
Public Shared Function IsBuiltInGroup (
	groupTypeId As ForgeTypeId
) As Boolean
public:
static bool IsBuiltInGroup(
	ForgeTypeId^ groupTypeId
)
static member IsBuiltInGroup :
        groupTypeId : ForgeTypeId -> bool
Parameters
groupTypeId ForgeTypeId
 The identifier to check.
Return Value
Boolean
 True if the ForgeTypeId identifies a built-in parameter group, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 A ForgeTypeId identifies a built-in parameter group if it corresponds to a valid BuiltInParameterGroup value.
See Also
Reference
ParameterUtils Class
Autodesk.Revit.DB Namespace